In [80]:


import pandas as pd

movies_title = pd.read_csv("c:/OST/movies_title.csv")
df = movies_title
df

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [81]:
df.shape

(215981, 2)

In [ ]:
#3. df 필수 명령 8가지 실행

In [82]:
#1) 첫 5행 데이터 보기
df.head(5)

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [83]:
#2) 마지막 5행 데이터보기
df.tail(5)

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [84]:
#3) 데이터,컬럼은 총 몇건?
df.shape

(215981, 2)

In [85]:
#4) 전체 컬럼은 총 몇건?
df.columns

Index(['title', 'year'], dtype='object')

In [86]:
#5) 컬럼 중 앞 2개 리스트 만들기
list(df.columns)[:2]

['title', 'year']

In [87]:
#6) 데이터프레임 전체 구조
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [88]:
#7) 결측치 확인
df.isnull()

        title   year
0       False  False
1       False  False
2       False  False
3       False  False
4       False  False
...       ...    ...
215976  False  False
215977  False  False
215978  False  False
215979  False  False
215980  False  False

[215981 rows x 2 columns]

In [89]:
df.isnull().sum()

title    0
year     0
dtype: int64

In [90]:
df.isnull().sum().sum()

0

In [91]:
#8) 데이터 요약 통계량 보기
df.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [92]:
#9) 구성별 카운트- 컬럼변수의 구성확인
df["title"]

0                  The Rising Son
1               Ashes of Kukulcan
2         The Thousand Plane Raid
3                Crucea de piatra
4                          The 86
                   ...
215976             Le mouton noir
215977        Edge of the Unknown
215978                      E yue
215979               Lakota Girls
215980               The Sting II
Name: title, Length: 215981, dtype: object

In [93]:
#10) 컬럼데이터 value순 정렬(내림차순)
df["title"].value_counts()

Hamlet                     19
Macbeth                    14
Carmen                     14
The Three Musketeers       12
She                        11
                           ..
The Left Eye                1
Makarras Conexion           1
Mon phoque et elles         1
Badman's Gold               1
Tu girtkamen - gaiqetsi     1
Name: title, Length: 197575, dtype: int64

In [94]:
#11) 컬럼데이터 index순 정렬(오름차순)
df["title"].value_counts().sort_index()

#1 Mamarazzi               1
#1 Serial Killer           1
#22 (mis_ing)              1
#5                         1
#50Fathers                 1
                          ..
xXx                        1
xXx: State of the Union    1
오전 3:15                    1
오전 4:00                    1
오전 9:04                    1
Name: title, Length: 197575, dtype: int64

In [95]:
df

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [96]:
df.index

RangeIndex(start=0, stop=215981, step=1)

In [109]:
df.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [97]:
df['title'].value_counts()

Hamlet                     19
Macbeth                    14
Carmen                     14
The Three Musketeers       12
She                        11
                           ..
The Left Eye                1
Makarras Conexion           1
Mon phoque et elles         1
Badman's Gold               1
Tu girtkamen - gaiqetsi     1
Name: title, Length: 197575, dtype: int64

In [107]:
# 4. 전체 영화는 몇개인가? 
df.value_counts().sum()

215981

In [108]:
#5. 가장 빠른 시기에 제작된 영화 2개를 찾아라. 
df.min()
print[]

title    #1 Mamarazzi
year             1894
dtype: object

In [112]:
 # 6. 제목이 "Hamlet"인 영화는 몇개인가? 
is_Hamlet=df["title"] == 'Hamlet'
count_Hamlet = df[is_Hamlet]
len(count_Hamlet)

19

In [125]:
# 7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열
is_Treasure=df["title"] == 'Treasure Island'
count_Treasure = df[is_Treasure]

count_Treasure.value_counts().sum() #또는 len(count_Treasure)

count_Treasure.value_counts()

title            year
Treasure Island  1918    1
                 1920    1
                 1934    1
                 1950    1
                 1972    1
                 1973    1
                 1985    1
                 1999    1
dtype: int64

In [ ]:
# 8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가?

In [136]:
is_moive1 = df['year'] >=1950
is_movie2 = df['year'] <= 1960
subset_df = df[is_moive1 & is_movie2 ]
subset_df

subset_df.value_counts().sum()

13577

In [132]:
df[(df['year'] >=1950) & (df['year'] <= 1960)]

                                         title  year
9                               Women's Prison  1955
37      La momia azteca contra el robot humano  1958
86                            Botta e risposta  1950
88                         Perdeu-se um Marido  1957
99                             Cone of Silence  1960
...                                        ...   ...
215856                    Tischlein, deck dich  1956
215890                        Some Like It Hot  1959
215915                             Black Widow  1951
215919                             Encrucijada  1956
215945                       Te sigo esperando  1952

[13577 rows x 2 columns]

In [135]:
df[(df['year'] >=1950) & (df['year'] <= 1960)].shape[0]

13577